In [106]:
import pandas as pd
import numpy as np

In [107]:
titanic = pd.read_excel('http://biostat.mc.vanderbilt.edu/wiki/pub/Main/DataSets/titanic3.xls')
titanic.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [108]:
titanic['first_name'] = titanic['name'].str.split('.').str.get(1)
titanic['first_name'].head()

0                      Elisabeth Walton
1                         Hudson Trevor
2                         Helen Loraine
3               Hudson Joshua Creighton
4     Hudson J C (Bessie Waldo Daniels)
Name: first_name, dtype: object

In [109]:
titanic['first'] = titanic['first_name'].str.split('(').str.get(0)
titanic['first'].head()

0            Elisabeth Walton
1               Hudson Trevor
2               Helen Loraine
3     Hudson Joshua Creighton
4                 Hudson J C
Name: first, dtype: object

In [110]:
titanic['second'] = titanic['first'].str.split(' ').str.get(2)
titanic['second'].head()

0     Walton
1     Trevor
2    Loraine
3     Joshua
4          J
Name: second, dtype: object

In [115]:
titanic.second.describe()

count     830
unique    412
top
freq       90
Name: second, dtype: object

In [116]:
jmeno = len(titanic) - 830
"Pouze 1 jméno má {} lidí.".format(jmeno)

'Pouze 1 jméno má 479 lidí.'

In [117]:
boats = titanic.groupby("boat").boat.count()
boats

boat
2           1
1           5
10         29
11         25
12         19
13         39
13 15       2
13 15 B     1
14         33
15         37
15 16       1
16         23
2          12
3          26
4          31
5          27
5 7         2
5 9         1
6          20
7          23
8          23
8 10        1
9          25
A          11
B           9
C          38
C D         2
D          20
Name: boat, dtype: int64

In [118]:
clun = np.argmax(boats)
"Nejvíce zachráněných bylo v člunu {}.".format(clun)

'Nejvíce zachráněných bylo v člunu 13.'